-- --------------------------------------------------------
-- 主机:                           127.0.0.1
-- 服务器版本:                        5.6.12-log - MySQL Community Server (GPL)
-- 服务器操作系统:                      Win64
-- HeidiSQL 版本:                  8.3.0.4694
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
-- 正在导出表  demo.post 的数据：~0 rows (大约)
/*!40000 ALTER TABLE `post` DISABLE KEYS */;
INSERT INTO `post` (`id`, `author`, `title`, `content`, `create_time`) VALUES
	(1, 1, '我的中学', '哈哈哈啊哈哈哈哈哈哈哈', 0),
	(2, 1, '我的小学', '我上小学啦啦啦啦啦', 1273833939),
	(3, 1, '我的高中', '我上高中啦啦啦啦啦啦', 1234567890),
	(4, 1, '我的大学', '我的大学好美啊啊啊啊啊啊。。。。。。', 123456789),
	(5, 2, '我是太君', '光阴在不知不觉中转瞬离去，让你无法把持朝夕的星移斗转。一转眼，已走近人生不惑的路标，勾勒完昔往的艰辛和孤寂，描摹着将来的天蓝与海阔......\r\n \r\n  沐浴着缕缕微风细雨，夏天令人难熬的热浪已荡然无存，窗外的榉树樱花在雨雾的滋润中显得碧绿无暇。这样的时节，这样的天气，正是农民麦收插秧的好时机。老婆说，娘家的母亲年龄已经很老了，仍在寒风细雨中守着自己的稻田。于是，穿上一身轻便的旧服装，搁下一切繁杂的事物，走向岳母家田间地头。\r\n \r\n  仅仅想到插秧，一切色彩斑斓的词汇立时失去了效能。面向黄土背朝天慢慢地在水稻田里移动，脚在稻田的泥泞中淌出二道长长的辄迹，脚下软滑难走，腰腿酸痛不堪。这种情境下，会感受到往常的闲情逸致被瞬间浇灭，天上人间只剩下刷刷的插秧声与自已佝偻的身体相互对应，濛濛细雨阻隔住田野的寂寥与外界的想象。此时，疲乏中的思绪总是那么特别的漫长，特别的遥远。\r\n \r\n   站在一个无垠的田野，顶着变幻莫测的天象，对盘中粒粒皆苦的意境才有了深刻憬悟。中国博大文化中几句简单的词章，哪怕是它最有内涵的几个文字，都可以拿来统摄某些阶层的全局，立刻会把丰腴浪漫的想象抹煞。其实，谁都是渺小的。无数渺小的组合，才溶成伟大的气象，溶成一望无垠的绿色茫茫。\r\n \r\n  在稻田里与家人边忙边谈，都不会十分在意。倒不是因为腰肢辛苦难与躬身，也不是因为贴近了田野与雨水的润泽，而是突然感悟到自己在空荡的原野、辛苦劳动的处境，顾影自怜，构成了逆境中思绪的羁绊。 这时所说的话语会很随意豁达，写出文字也会变得滋润熨贴。\r\n \r\n  我们这一代命贱，干了一上午的活，仍然满身精力充沛。这个时刻唯有老婆才立时怜起年迈的岳母，平时只是偶尔回家看看带点东西。今天看到诺大的年纪也在茫茫水稻田里蹒跚，老婆不免有些伤感与悲凉。\r\n \r\n   我依稀记得老家水稻田特别多，刚包田到户时我家有十几亩稻田。在家长带领下孩子们都要武装上阵，年小的弟弟顽皮，遮遮掩掩地偷懒。我是家中长子，推完了麦子，还要继续去挑稻秧，在泥泞的稻田梗道上走上一晌午，身体早已散了架，腿更不是自已的，也不听使唤，一崴一崴地拖着往前走。那年月，人人都想从贫穷中立起身来，一站到水稻田边，脸上就已不见惶恐与焦虑，既然来了，不管工程有多浩大，该干什么就干什么吧。一种本该属于自己生命的力量又萌动起来，这生命来自遥远的历史，来自深厚的故土，唤醒它，仅需要一个的轻微信念。\r\n \r\n  一天又一天，田野完全绿了起来，繁重的体力透支与每天水泡泥浸， 每个人都已面黄肌瘦 ，衣衫也变得褴褛不堪，他们站在无垠的稻田边爽朗地笑着。远处水稻秧苗正频频挥手， 微风中送来飒飒声响，像是在致意，也是在吟唱，飘荡回旋在茫茫的原野，酝酿着稻谷丰收的粮仓。', 123456789),
	(6, 2, '我来了', '走进乡村就是走进孤独——就是走进了绿色的孤独里。满眼满眼的绿，很是杂乱潦草，荒芜的田园、庭院，蒿草密布，荆棘丛生，不安分的记忆总是把一些往事留下来。记忆还在旧日的野地里和童伴一起打滚，在山坳里追赶洁白如花的羊群，在旷野里吼一吼自编自唱的山歌，在刺骨的清泉里摸一回鱼虾，游一回泳，再让父母在嫩嫩的背脊上留几条笤帚花儿。那些不安分的记忆帮你念叨着过去如何如何的好。儿时的乡村在云雾里，今天的乡村却在孤独里，你本来很是轻松的心却来了一丝不够彻底的惆怅，也来了一丝道不清的暖暖的幸福，你的感情世界里莫名地生出了些非分之想。此时此刻的你，只想找一片绿叶，很深情的绿叶，躺在那上面睡一会儿，安安静静地，把世俗抛到九霄云外的另一个宇宙。这些时间里，你就圣洁得如同拌豆腐的葱儿，若大的舞台里，空落落的只有你，世界给你一只葫芦你只想画一只葫芦。你不怕孤独，你就是野花上的那只孤独无猜的蝶儿，你就是那乔木头顶上无影无踪的风儿，你就是那彩虹底下那朵烂漫天真的花儿......世界牢牢挣在你的手心里，一切无精打采的藤滕曼曼，一切荒荒芜芜的蓼草，因为有你的多情，都鲜活起来，一起随你孤独的舞蹈而舞蹈。风景不再是在人们刻意打扮的花园里，不再是在人头攒动的十字街头里，不再是在翩翩起舞的喧嚣舞池里，就在绿色给生命和你带来感动的那一刹那倾里。', 1234567890),
	(7, 3, '毕业一周年，你们还好吗', '伴随着张震岳的这首老歌，仿佛我又回到了过去，回到了大学即将分别的日子，带着不舍与迷惘和他们说再见。又是一年毕业季，看着朋友圈各种晒毕业照，毕业旅行照，学士帽漫天的飞舞，各种送别活动在鲜花和掌声中慢慢退去色彩，心里不时充满着各种思念。\r\n\r\n   离开校园整整一年了，每当和别人谈起母校各种自豪，大学生活各种多彩，人生经历各种丰富，其实内心还是留有种种遗憾；四年的蹉跎时光，有人收获了知识，有人收获了人生阅历，还有人收获了爱情，而我收获的只有那纯洁的友谊，兄弟情。\r\n\r\n   分别整整一年了，还记得那时我们都是多么的不舍，同学情，兄弟情，混合着酒精流到心里，一米八几的大男孩哭的稀里哗啦，拥抱着说再见；之后的我们离开了熟悉的校园，奔赴在各个工作岗位，去体现自己的价值，为生活而忙碌着；一转身，有些人真的就再也不见。\r\n\r\n   还记得那些年我们一起扛着班旗去踏青，一起秋游的欢乐；还记得全班男生与妇产系联谊的搞笑瞬间；还记得那年我们评出的班花，追过的女孩；所有的所有都留在了那个瞬间，定格成一副大大的毕业照。相信我们每个人再看到毕业照和毕业视屏都会满怀感慨和留念那段岁月，那段有你有我的岁月，一转眼只剩下我们自己，独自拼搏在陌生的城市。\r\n\r\n   毕业一周年，你们还好吗？工作还顺利吗？学习还顺心吗？一切都回不了头，只能在心里默默地想着你们，希望你们安好…………………..', 1234567890),
	(8, 3, '岁月的风', '现实与往事告别，短暂与漫长相拥，这，就是岁月！\r\n\r\n岁月宛如从不停息的风，掠过四季，掠过流年。\r\n\r\n生活似漂浮的船，在岁月的风中日夜兼程，没有返程的船票，没有固定的航向。在到达彼岸之前，生活的船将命运交给了岁月的风！\r\n\r\n流水走过的地方有生命，白云飘过的地方有梦境，我，在生命的旅程中追逐缱慻的梦，是岁月的风将梦编织，又是岁月的风将梦吹醒。\r\n\r\n岁月的风，卷起天边那一抹云，让笑颜在晨曦中绽放，在时间的流逝中把热情挥洒，渐渐地，在天的另一端，一日的精彩被晚霞收藏！当暮色渐浓，岁月的风，又将浮躁与繁华吹尽，让宁静住进疲惫的心，让回忆充释每一个梦！\r\n\r\n岁月的风，采来丝丝的云，汇成涓涓水韵，在厌倦了昨日的热情和昨夜的宁静之后，把雨滴播撒！看，那流浪的尘埃已寻到了迷失的归宿，在湿润的缝隙中安了身，听，那窗外的风铃在声声吟唱，将温润的柔情云绕与空宇。\r\n\r\n一路前行，一路欢歌，在飞逝的时光里，唯有岁月的风，尽情欢愉，不知它可曾留意路过的景，不知它是否懂得尘世的情，若说有情，叶落花谢为何反复重演？若说无情，为何总让美好在记忆中浮现？\r\n\r\n岁月的风，吹响四季更迭的号角，懵懵懂懂中集结下一次轮回。\r\n\r\n春，在流淌的惬意中走来，明知是稍纵即逝的色彩，还是那么浓烈；\r\n\r\n夏，在火热的情怀中迸发，明知火热过后是冷淡，还是那么执着；\r\n\r\n秋，在飘零的离愁中耗尽，明知离愁之后是无期，还是那么淡然；\r\n\r\n冬，在萧条中凝固自己，明知是冷冷的束缚，还是那么坚定。', 1234567890);
/*!40000 ALTER TABLE `post` ENABLE KEYS */;

-- 正在导出表  demo.user 的数据：~0 rows (大约)
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` (`id`, `username`, `password`, `email`) VALUES
	(1, 'tonyzheng', 'abc123_', '865793105@qq.com'),
	(2, 'harrysun', 'abc123_', 'crazyman@163.com'),
	(3, 'vincenthou', 'abc123_', 'test@qq.com'),
	(4, 'devinjin', 'abc123_', 'devin@qq.com'),
	(5, 'aaaaa', 'abc123_', '123456789@qq.com'),
	(6, 'bbbbbb', 'abc123_', 'lkjhgfddsa@qq.com');
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
